GopalSaraf/Practicals/PSDL/include/proc/pic18lf27j53.inc
// Register: LATC
#define LATC LATC
LATC                                     equ 0F8Bh
// bitfield definitions
LATC_LATC0_POSN                          equ 0000h
LATC_LATC0_POSITION                      equ 0000h
LATC_LATC0_SIZE                          equ 0001h
LATC_LATC0_LENGTH                        equ 0001h
LATC_LATC0_MASK                          equ 0001h
LATC_LATC1_POSN                          equ 0001h
LATC_LATC1_POSITION                      equ 0001h
LATC_LATC1_SIZE                          equ 0001h
LATC_LATC1_LENGTH                        equ 0001h
LATC_LATC1_MASK                          equ 0002h
LATC_LATC2_POSN                          equ 0002h
LATC_LATC2_POSITION                      equ 0002h
LATC_LATC2_SIZE                          equ 0001h
LATC_LATC2_LENGTH                        equ 0001h
LATC_LATC2_MASK                          equ 0004h
LATC_LATC6_POSN                          equ 0006h
LATC_LATC6_POSITION                      equ 0006h
LATC_LATC6_SIZE                          equ 0001h
LATC_LATC6_LENGTH                        equ 0001h
LATC_LATC6_MASK                          equ 0040h
LATC_LATC7_POSN                          equ 0007h
LATC_LATC7_POSITION                      equ 0007h
LATC_LATC7_SIZE                          equ 0001h
LATC_LATC7_LENGTH                        equ 0001h
LATC_LATC7_MASK                          equ 0080h
LATC_LC0_POSN                            equ 0000h
LATC_LC0_POSITION                        equ 0000h
LATC_LC0_SIZE                            equ 0001h
LATC_LC0_LENGTH                          equ 0001h
LATC_LC0_MASK                            equ 0001h
LATC_LC1_POSN                            equ 0001h
LATC_LC1_POSITION                        equ 0001h
LATC_LC1_SIZE                            equ 0001h
LATC_LC1_LENGTH                          equ 0001h
LATC_LC1_MASK                            equ 0002h
LATC_LC2_POSN                            equ 0002h
LATC_LC2_POSITION                        equ 0002h
LATC_LC2_SIZE                            equ 0001h
LATC_LC2_LENGTH                          equ 0001h
LATC_LC2_MASK                            equ 0004h
LATC_LC6_POSN                            equ 0006h
LATC_LC6_POSITION                        equ 0006h
LATC_LC6_SIZE                            equ 0001h
LATC_LC6_LENGTH                          equ 0001h
LATC_LC6_MASK                            equ 0040h
LATC_LC7_POSN                            equ 0007h
LATC_LC7_POSITION                        equ 0007h
LATC_LC7_SIZE                            equ 0001h
LATC_LC7_LENGTH                          equ 0001h
LATC_LC7_MASK                            equ 0080h

// Register: PIE4
#define PIE4 PIE4
PIE4                                     equ 0F8Eh
// bitfield definitions
PIE4_CCP3IE_POSN                         equ 0000h
PIE4_CCP3IE_POSITION                     equ 0000h
PIE4_CCP3IE_SIZE                         equ 0001h
PIE4_CCP3IE_LENGTH                       equ 0001h
PIE4_CCP3IE_MASK                         equ 0001h
PIE4_CCP4IE_POSN                         equ 0001h
PIE4_CCP4IE_POSITION                     equ 0001h
PIE4_CCP4IE_SIZE                         equ 0001h
PIE4_CCP4IE_LENGTH                       equ 0001h
PIE4_CCP4IE_MASK                         equ 0002h
PIE4_CCP5IE_POSN                         equ 0002h
PIE4_CCP5IE_POSITION                     equ 0002h
PIE4_CCP5IE_SIZE                         equ 0001h
PIE4_CCP5IE_LENGTH                       equ 0001h
PIE4_CCP5IE_MASK                         equ 0004h
PIE4_CCP6IE_POSN                         equ 0003h
PIE4_CCP6IE_POSITION                     equ 0003h
PIE4_CCP6IE_SIZE                         equ 0001h
PIE4_CCP6IE_LENGTH                       equ 0001h
PIE4_CCP6IE_MASK                         equ 0008h
PIE4_CCP7IE_POSN                         equ 0004h
PIE4_CCP7IE_POSITION                     equ 0004h
PIE4_CCP7IE_SIZE                         equ 0001h
PIE4_CCP7IE_LENGTH                       equ 0001h
PIE4_CCP7IE_MASK                         equ 0010h
PIE4_CCP8IE_POSN                         equ 0005h
PIE4_CCP8IE_POSITION                     equ 0005h
PIE4_CCP8IE_SIZE                         equ 0001h
PIE4_CCP8IE_LENGTH                       equ 0001h
PIE4_CCP8IE_MASK                         equ 0020h
PIE4_CCP9IE_POSN                         equ 0006h
PIE4_CCP9IE_POSITION                     equ 0006h
PIE4_CCP9IE_SIZE                         equ 0001h
PIE4_CCP9IE_LENGTH                       equ 0001h
PIE4_CCP9IE_MASK                         equ 0040h
PIE4_CCP10IE_POSN                        equ 0007h
PIE4_CCP10IE_POSITION                    equ 0007h
PIE4_CCP10IE_SIZE                        equ 0001h
PIE4_CCP10IE_LENGTH                      equ 0001h
PIE4_CCP10IE_MASK                        equ 0080h

// Register: PIR4
#define PIR4 PIR4
PIR4                                     equ 0F8Fh
// bitfield definitions
PIR4_CCP3IF_POSN                         equ 0000h
PIR4_CCP3IF_POSITION                     equ 0000h
PIR4_CCP3IF_SIZE                         equ 0001h
PIR4_CCP3IF_LENGTH                       equ 0001h
PIR4_CCP3IF_MASK                         equ 0001h
PIR4_CCP4IF_POSN                         equ 0001h
PIR4_CCP4IF_POSITION                     equ 0001h
PIR4_CCP4IF_SIZE                         equ 0001h
PIR4_CCP4IF_LENGTH                       equ 0001h
PIR4_CCP4IF_MASK                         equ 0002h
PIR4_CCP5IF_POSN                         equ 0002h
PIR4_CCP5IF_POSITION                     equ 0002h
PIR4_CCP5IF_SIZE                         equ 0001h
PIR4_CCP5IF_LENGTH                       equ 0001h
PIR4_CCP5IF_MASK                         equ 0004h
PIR4_CCP6IF_POSN                         equ 0003h
PIR4_CCP6IF_POSITION                     equ 0003h
PIR4_CCP6IF_SIZE                         equ 0001h
PIR4_CCP6IF_LENGTH                       equ 0001h
PIR4_CCP6IF_MASK                         equ 0008h
PIR4_CCP7IF_POSN                         equ 0004h
PIR4_CCP7IF_POSITION                     equ 0004h
PIR4_CCP7IF_SIZE                         equ 0001h
PIR4_CCP7IF_LENGTH                       equ 0001h
PIR4_CCP7IF_MASK                         equ 0010h
PIR4_CCP8IF_POSN                         equ 0005h
PIR4_CCP8IF_POSITION                     equ 0005h
PIR4_CCP8IF_SIZE                         equ 0001h
PIR4_CCP8IF_LENGTH                       equ 0001h
PIR4_CCP8IF_MASK                         equ 0020h
PIR4_CCP9IF_POSN                         equ 0006h
PIR4_CCP9IF_POSITION                     equ 0006h
PIR4_CCP9IF_SIZE                         equ 0001h
PIR4_CCP9IF_LENGTH                       equ 0001h
PIR4_CCP9IF_MASK                         equ 0040h
PIR4_CCP10IF_POSN                        equ 0007h
PIR4_CCP10IF_POSITION                    equ 0007h
PIR4_CCP10IF_SIZE                        equ 0001h
PIR4_CCP10IF_LENGTH                      equ 0001h
PIR4_CCP10IF_MASK                        equ 0080h

